{"hed":"Edil Baiyzbekov","dek":"Award-winning data visualization engineer and artist","intro":"I find new ways to tell, feel and experience stories with data.","email":"baiyzbekov.edil@gmail.com","introSeo":"I find new ways to tell, feel and experience stories with data. Open to work!","keywords":"hire, software developer data visualization engineer, data journalist, data analyst, talent, data scientist, data visualization developer, full stack developer, full stack data journalist, data developer, visual journalist,","theme":"dark","levels":[{"level":"0","theme":"blue","text":"I love to explore ideas beyond data visualizations. I use <mark>C#</mark>, Game engines and AR technologies for immersive projects. <br> I make dope interactive vizs and UI with <mark>TypeScript</mark>, D3, <mark>Svelte</mark>, React and other technologies. I rely on <mark>Python</mark> for automation, analysis and ML. And I love to transform data into music or other forms that you can feel.<br> I worked as a <mark>Lead Data Visualization Engineer</mark> at <a target=_blank href=https://infogr8.com>Infogr8</a>, Full-stack developer at <mark>UNICEF Office of Innovation</mark>, and visual data journalist for <mark>Radio Free Europe/Radio Liberty</mark>, Texty.org.ua, Kloop Media and other NGOs.<br>Tap right to see which technologies I used in my projects👨🏽‍💻","next":"Sound of War","slides":[{"theme":"blue","text":"Stack: <mark>TypeScript</mark>, D3, Svelte, SvelteKit, React, Nextjs, JavaScript, TailwindCss, Mapbox, Nodejs, WebGL, Threlte, Layercake.  <br><mark>Python</mark>, pandas, selenium, bs4, numpy, asyncio, keras, scikit-learn, SQL.<br><mark>C#</mark>, Unity, DOTS, Tiny.<br>QGIS, Spark AR, Tableau, flourish, datawrapper, Ableton, spreadsheets, git, figma, adobe Illustrator, blender, adobe premiere.<br> Ok, enough talking, tap below to see my stack in action!🚀"}]},{"level":"1","next":"Unity simulation","gif":"soundofwar","text":"Audiovisual data art project: How Russia shelled Ukraine","tech":"TypeScript, Threejs, Threlte, Blender, Ableton","theme":"pink","slides":[{"theme":"pink","text":"Data visualizations can tell powerful stories. But we can lose our emotional connection with people experiencing war in the sea of statistics and graphics. Over time it's getting harder to understand the scale of destructions Russia the terrorist state commits in Ukraine. I created this project to let you listen to the war data and explore it from a new perspective. I made an interactive <a href=https://soundofwar.art>3D map</a> with flowers representing different attacks. The most exciting part is a <mark>data generated music</mark> from news media about shellings in Ukraine. Take a look and experience the project!"}]},{"level":"2","next":"odi D3","gif":"unity","text":"Ukrainian COVID-19 victims on the streets of Kyiv.","tech":"C#, Unity, WebGL, JS, Blender","theme":"yellow","slides":[{"theme":"yellow","text":"The idea for this project came from a realization about how difficult it might be for a reader to process the number of deaths caused by COVID-19. Graphs and tables just can’t communicate the severity of the problem or approach it from a humane position. I made a <a href=https://rolikasi.github.io/covid_ukraine_unity/Tiny3D.html>WebGL 3D simulation</a> of Kyiv’s city center with <mark>Unity Game Engine</mark>, <mark>C#</mark> and <mark>JS</mark>. You can change the number of people, walk among them and see the crowded streets from a bird’s-eye view."}]},{"level":"3","gif":"odi","next":"DoD SvelteKit D3","text":"How well is your country doing on policy for the secondary use of health data?","tech":"JavaScript, D3","awards":"<a target=”_blank” href=https://www.communicatemagazine.com/news/2022/datacomms-awards-2022-winners-announced/>DataComms Awards</a>","theme":"pink","slides":[{"theme":"pink","text":"I’ve developed an <a target=”_blank” href=https://secondary-use-health-data.theodi.org/horizon-scanning/>interactive timeline app</a> to track European Commission (EC) policy activity around the secondary use of health data and expanded the functionalities of the exploration data tool. The most exciting part of such apps is that custom <mark>D3 visualizations</mark> become part of the UI. Users can find <mark>more insights or call to action</mark> by <mark>interacting</mark> with graphics."}]},{"level":"4","gif":"dod","next":"Instastory","text":"Custom interactive data portal about the US tech manufacturing workforce.","tech":"SvelteKit, TypeScript, TailwindCss, D3","theme":"blue","slides":[{"theme":"blue","text":"I’ve developed an <a target=”_blank” href=”https://dod-mantech.vercel.app”> interactive data portal</a> that increases knowledge around the US advanced tech manufacturing workforce. It’s a full-stack application made with modern state-of-the-art stack leveraging <mark>SvelteKit, TypeScript, Tailwindcss and Layercake</mark> framework to build Custom <mark>D3</mark> charts in Svelte way."}]},{"level":"5","gif":"instaVideo","Next":"mapbox for Unicef","text":"How Kyrgyz parliament copy-pasted russian laws.","tech":"Python, JS, html, flourish","awards":"<a target=”_blank” href=https://gijn.org/2020/07/09/data-journalism-top-10-pace-of-global-covid-19-deaths-who-can-work-from-home-visualizations-for-the-colorblind-skin-tone-and-sports/>Top-10 by GIJN</a>","theme":"light","slides":[{"theme":"light","text":"I scraped and analyzed all bills of the 6th Kyrgyz parliament and found that about 40% of them have similarities with Russian bills. 17 bills were almost complete copies of Russian laws. <br>I designed this project in Instagram-story format using <mark>JS</mark>, <mark>html</mark>, <mark>css</mark> and flourish animated charts. It was also featured in <a target=”_blank” href=https://gijn.org/2020/07/09/data-journalism-top-10-pace-of-global-covid-19-deaths-who-can-work-from-home-visualizations-for-the-colorblind-skin-tone-and-sports/> a top-10 data stories rating by GIJN🎉</a>."}]},{"level":"6","next":"Scrolly D3js","gif":"dpgmap","text":"Map visualization of digital public goods for Unicef Office of Innovations","tech":"MapboxGL, React, scrollama","awards":"","theme":"blue","slides":[{"theme":"blue","text":"I created an <mark>interactive, easy-to-edit and rich</mark> dashboard that shows where open source tech solutions for good are deployed, developed, and which Sustainable Development Goals they achieve in each country. I built this project with <mark>NextJS, React, Mapbox GL and scrollama</mark>. Digital public goods are open source software, open data, AI, standards, and content that digitally harmless, and relevant to UN’s 2030 Sustainable Development Goals."}]},{"level":"7","next":"femicide","gif":"d3js","text":"How Kyrgyz parliamentarians change their political parties.","tech":"Python, JS, D3, scrollama","awards":"<a target=”_blank” href=https://gijn.org/2020/09/03/data-journalism-top-10-tracking-police-accountability-racism-and-housing-chinas-hidden-prison-camps/>Top-10 by GIJN</a>","theme":"yellow","slides":[{"theme":"yellow","text":"Members of Kyrgyzstan’s parliament often choose their political party by how well its agenda aligns with their personal goals rather than their political values. This results in representatives frequently moving to parties that better suit their private interests, even if their agenda is opposite to their previous union’s program. I analyzed the composition of the six Kyrgyz parliaments and visualized this process using <mark>D3</mark> and <mark>scrollytelling</mark>. This project got in <a target=”_blank” href=https://gijn.org/2020/09/03/data-journalism-top-10-tracking-police-accountability-racism-and-housing-chinas-hidden-prison-camps/>top-10 data stories rating by GIJN🎉</a>"}]},{"level":"8","next":"Ar project","gif":"femicid","text":"“I would have killed her anyway”. Investigation of femicide in Kyrgyzstan","tech":"Python, Selenium, asyncio","awards":"<a target=”_blank” href=https://sigmaawards.org/i-would-have-killed-her-anyway-kloops-investigation-of-femicide-in-kyrgyzstan/>Winner of the Sigma Awards 2021</a>","theme":"pink","slides":[{"theme":"pink","text":"This project is a <a target=”_blank” href=https://sigmaawards.org/i-would-have-killed-her-anyway-kloops-investigation-of-femicide-in-kyrgyzstan/>winner</a> of the international data journalism competition <mark>The Sigma Awards 2021</mark> 🎉. There are no publicly available official statistics on women’s murders in Kyrgyzstan. So I <mark>scraped</mark> more than 54000 criminal news articles to understand the femicide patterns in Kyrgyzstan. We identified around 80 words and sentences in accordance with femicide criteria. Then I created a <mark>Python</mark> script that converts them into flexible regex patterns to fit the complex structures of the Russian language. It let me find more than 3000 news and press releases that covered the women’s murders."}]},{"level":"9","gif":"arcovid","next":"Automation","text":"AR-game quiz about covid myths","tech":"Spark AR, Figma","theme":"dark","slides":[{"theme":"dark","text":"The first ever <mark>AR</mark>-mask in Instagram that tells a data story about gender inequality. It reached more than <mark>650k</mark> views and <mark>6200</mark> shares.","image":"gender"}]},{"level":"10","text":"A telegram bot for victims of domestic violence to safely ask for help.","gif":"telegram","tech":"Python, MongoDB, Heroku","awards":"<a target=”_blank” href=https://www.kg.undp.org/content/kyrgyzstan/en/home/presscenter/pressreleases/2020/05/it-solutions-developed-by-youth-will-help-to-cope-with-domestic-.html>Winner of the UN hackathon</a>","next":"","theme":"blue","slides":[{"theme":"blue","text":"This telegram bot helps women to recognize signs of domestic violence, gives them information on how to protect themselves and connects them to the nearest crisis centers. My team developed bot at <a target=”_blank” href=https://www.kg.undp.org/content/kyrgyzstan/en/home/presscenter/pressreleases/2020/05/it-solutions-developed-by-youth-will-help-to-cope-with-domestic-.html> the UN hackathon</a>. We have won the 🏅<mark>1st</mark> place in the competition."}]},{"level":"11","next":"","text":"Let’s collab!🚀","outro":"<a href=\"mailto:baiyzbekov.edil@gmail.com\" target=_blank>baiyzbekov.edil@gmail.com</a>","theme":"light","slides":[{"theme":"light","text":"<span style=font-weight:bold>Why is it getting hotter in Bishkek - explained on heat maps.</span> <br> I used raw satellite data in QGIS to calculate the surface temperature and the vegetation index.","image":"maps"},{"theme":"light","text":"<span style=font-weight:bold>How polluted Central Asian air is.</span> <br> The first media research about air pollution in Central Asia.","image":"air"},{"theme":"light","text":"<span style=font-weight:bold>How Kyrgyz parliament members violate regulations and pass laws without a quorum. </span> <br>I <a target=_blank href=https://github.com/Rolikasi/button_pushers>scraped, cleaned and analyzed protocols of meetings</a> for this investigation.","image":"currenttv"},{"theme":"light","text":"Oh, You’re really interested in my work!) <br>Watch <span style=font-weight:bold>\"Pump the air, the movement is on.\" A short documentary about traffic jams at the border of Kyrgyzstan. </span> <br>I created this film when I worked as a lead video producer in Kloop.","image":"film"}]}]}