{"hed":"Edil Baiyzbekov","dek":"Full-stack Data-journalist","intro":"I’m exploring new ways of telling stories with code in digital spaces.","email":"bayizbekovedil@gmail.com","levels":[{"level":"0","text":"I love to experiment with visual storytelling, so my technology stack goes beyond 🐍. I use <mark>C#</mark>, Unity game engine and AR technologies for immersive projects. <br>I can scrape, clean and analyze data with <mark>Python</mark>. I also use it to automate scripts and experiment with ML.<br> After that I make dope visualizations with <mark>JavaScript</mark>, D3 and other libraries. <br>Tap right to see what technologies I have used in my projects👨🏽‍💻.","next":"D3js","slides":[{"text":"Stack: <mark>Python</mark>, pandas, selenium, bs4, numpy, asyncio, keras, scikit-learn.<br><mark>JavaScript</mark>, D3, Svelte, react, scrollama, html, css, archieML.<br><mark>C#</mark>, Unity, DOTS, WebGL, Tiny.<br>QGIS, Spark AR, Tableau, flourish, datawrapper, SQL, spreadsheets, git, figma, adobe Illustrator, blender, adobe premiere.<br> Ok, enough talking, tap below to see my stack in action!🚀"}]},{"level":"1","next":"Unity simulation","gif":"d3js","text":"How Kyrgyz parliamentarians change their political parties.","tech":"Python, JS, D3, scrollama","awards":"<a target=”_blank” href=https://gijn.org/2020/09/03/data-journalism-top-10-tracking-police-accountability-racism-and-housing-chinas-hidden-prison-camps/>Top-10 by GIJN</a>","slides":[{"text":"Members of Kyrgyzstan’s parliament often choose their political party by how well its agenda aligns with their personal goals rather than their political values. This results in representatives frequently moving to parties that better suit their private interests, even if their agenda is opposite to their previous union’s program. I analyzed the composition of the six Kyrgyz parliaments and visualized this process using <mark>D3</mark> and <mark>scrollytelling</mark>. This project got in <a target=”_blank” href=https://gijn.org/2020/09/03/data-journalism-top-10-tracking-police-accountability-racism-and-housing-chinas-hidden-prison-camps/>top-10 data stories rating by GIJN🎉</a>"}]},{"level":"2","next":"Instastory","gif":"unity","text":"Ukrainian COVID-19 victims on the streets of Kyiv.","tech":"C#, Unity, WebGL, JS, Blender","slides":[{"text":"The idea for this project came from a realization about how difficult it might be for a reader to really process the number of deaths caused by COVID-19. Graphs and tables just can’t communicate the severity of the problem or approach it from a humane position. I made a <a href=https://rolikasi.github.io/covid_ukraine_unity/Tiny3D.html>WebGL 3D simulation</a> of Kyiv’s city center with <mark>Unity Game Engine</mark>, <mark>C#</mark> and <mark>JS</mark>. You can change the number of people, walk among them and see the crowded streets from the bird’s-eye view."}]},{"level":"3","gif":"insta","next":"AR","text":"How Kyrgyz parliament copy-pasted russian laws.","tech":"Python, JS, html, flourish","awards":"<a target=”_blank” href=https://gijn.org/2020/07/09/data-journalism-top-10-pace-of-global-covid-19-deaths-who-can-work-from-home-visualizations-for-the-colorblind-skin-tone-and-sports/>Top-10 by GIJN</a>","slides":[{"text":"I scraped and analyzed all bills of the 6th Kyrgyz parliament and found that about 40% of them have similarities with Russian bills. 17 bills were almost complete copies of Russian laws. <br>I designed this project in Instagram-story format using <mark>JS</mark>, <mark>html</mark>, <mark>css</mark> and flourish animated charts. It was also featured in <a target=”_blank” href=https://gijn.org/2020/07/09/data-journalism-top-10-pace-of-global-covid-19-deaths-who-can-work-from-home-visualizations-for-the-colorblind-skin-tone-and-sports/> a top-10 data stories rating by GIJN🎉</a>."}]},{"level":"4","gif":"arcovid","next":"Automation","text":"AR-game quiz about covid myths","tech":"Spark AR, Figma","slides":[{"text":"The first ever <mark>AR</mark>-mask in Instagram that tells a data story about gender inequality. It reached more than <mark>650k</mark> views and <mark>6200</mark> shares.","image":"gender"}]},{"level":"5","text":"A telegram bot for victims of domestic violence to safely ask for help.","gif":"telegram","tech":"Python, MongoDB, Heroku","awards":"<a target=”_blank” href=”https://www.kg.undp.org/content/kyrgyzstan/en/home/presscenter/pressreleases/2020/05/it-solutions-developed-by-youth-will-help-to-cope-with-domestic-.html”>Winner of the UN hackathon</a>","next":"","slides":[{"text":"This telegram bot helps women to recognise signs of domestic violence, gives them information on how to protect themselves and connects them to the nearest crisis centers. My team developed bot at <a target=”_blank” href=”https://www.kg.undp.org/content/kyrgyzstan/en/home/presscenter/pressreleases/2020/05/it-solutions-developed-by-youth-will-help-to-cope-with-domestic-.html”> the UN hackathon</a>. We have won the 🏅<mark>1st</mark> place in the competition."}]},{"level":"6","next":"","text":"Let’s collab!🚀","outro":"baiyzbekovedil@gmail.com","slides":[{"text":"<span style=font-weight:bold>Why is it getting hotter in Bishkek - explained on heat maps.</span> <br> I used raw satellite data in QGIS to calculate the surface temperature and the vegetation index.","image":"maps"},{"text":"<span style=font-weight:bold>Study on femicide in Kyrgyzstan.</span> <br> I scraped more than 54 000 criminal news to recreate the picture of femicide in Kyrgyzstan.","image":"femicid"},{"text":"<span style=font-weight:bold>How polluted Central Asian air is.</span> <br> The first media research about air pollution in Central Asia.","image":"air"},{"text":"<span style=font-weight:bold>How Kyrgyz parliament members violate regulations and pass laws without a quorum. </span> <br>I <a target=_blank href=https://github.com/Rolikasi/button_pushers>scraped, cleaned and analyzed protocols of meetings</a> for this investigation.","image":"currenttv"}]}]}